#*数据项是数据的最小标识单位（如：作者，年份）
#数据元素又称元素，节点等
#P2总结：讲了数据，数据元素和数据项的概念。

#数据对象可以看作是class
#P3总结：讲了三种数据逻辑结构以及数据逻辑结构structure = (D,R),还有<a1,a2>代表前后关系

#P4总结：讲了几种存储结构（顺序存储，链表存储）

#索引结构：先查目录，再跳转。哈希结构：直接算出跳转的地址
#数据类型一般有 int str list dict tuple
#P5总结：讲了索引存储和哈希存储，以及几种数据类型

#树，图等，只要用一个类把它们封装起来，并且只通过类的方法操作它们，那么它们就是抽象数据类型
#P6总结：讲了抽象数据类型的写法（一半）

#P7总结：抽象数据结构的实现

#对数据结构的操作应该用算法来描述，算法的实现依赖于数据结构
#P8总结：讲了算法的有穷性，确定性，可行性，有输入和输出；算法应该正确（最基本），健壮（输入的数据不合适也不会有大问题）,高效（时间，空间高效）

#P9：辗转相除法（具体细节有待学习）

#P10：讲了算法的时间复杂度T(n)。一般有几种类型：O(1),O(lbn),O(n),O(n**2),O(n**3)

#P11-P13:题目

